//
// Created by wangd on 2026/7/22.
//
// 转义字符

#include <iostream>

using namespace std;

int main()
{
    char a = '\a';
    cout << int(a) <<endl;
    char n = '\n';
    cout << "英雄算法联盟" << n;

    cout << "英雄算法联盟\t夜深人静写算法" << endl;
    cout << "英雄算法联盟\\夜深人静写算法" << endl;
    cout << "英雄算法联盟\0夜深人静写算法" << endl;

    return 0;
}

/*
 * \077
* 合法八进制转义（C/C++/C 风格字符串）
C 语言八进制转义格式：\ddd，d 只能是 0~7，最多 3 位。
\077 = 八进制 077 = 十进制 63，对应 ASCII：?
plaintext
077(8) = 7×8? + 7×8? = 63 → '?'
 *
 * \088
* 解析规则：
解析器读到 \0，尝试往后读取八进制数字，下一位是 8，8 不属于 0~7 合法八进制数字，转义直接终止。
因此 \088 被拆分为：
\0 → ASCII 0（空字符）
'8' 普通字符
'8' 普通字符
等价字符序列：{'\0', '8', '8'}
 */